Repository: th4nhtung/hanayo
Catalog: data/locales/templates-*.po
Languages: th

source: You're already logged in!
th: คุณเข้าสู่ระบบอยู่แล้ว

source: Submit
th: ส่ง

source: Username
th: ชื่อผู้ใช้

source: Password
th: รหัสผ่าน

source: Invalid CSRF token
th: รหัส CSRF ผิดพลาด

source: Your session has expired. Please try redoing what you were trying to do.
th: เซสชั่นหมดอายุ ลองทำใหม่ดูอาจจะหายก็ได้นะ

source: That user could not be found.
th: เราไม่เห็นเจอผู้ใช้นั้น

source: Your settings have been saved.
th: การตั้งค่าของคุณได้ถูกบันทึกแล้ว

source: Request beatmap ranking
th: ขอให้บีทแมพอยู่ในโหมดแรงค์

source: Want to play an unranked beatmap and get pp? You can submit beatmaps rank requests here!
th: ต้องการอยากให้แมพที่ไม่แรงค์แต่ได้ PP งั้นเหรอ? คุณสามารถส่งบีทแมพที่อยากให้แรงค์ที่นี่ได้เลย!

source: Queue status
th: สถานะคิวตอนนี้

source: by you
th: โดยคุณ

source: Requests submitted
th: ส่งคำขอไปแล้วทั้งหมด

source: In the past 24 hours
th: ในเมื่อ 24 ชั่วโมงที่แล้ว

source: Request a beatmap
th: ขอบีทแมพ

source: You cannot currently request beatmaps!
th: คุณยังขอตอนนี้ไม่ได้นะ!!

source: Please try again
th: ลองใหม่อีกครั้งนึงนะ

source: Reset password
th: รีเซ็ตรหัสผ่าน

source: Glad to have you back here, %s! To finish the password recovery, type in a new password:
th: ยินดีที่เห็นคุณกลับมานะ! %s! เพื่อจะให้รหัสผ่านถูกรีเซ็ตใหม่ทั้งหมด กรุณาใส่รหัสผ่านใหม่ที่ช่องนี้:

source: Nope.
th: ไม่อ่ะ

source: That key could not be found. Perhaps it expired?
th: เราไม่เจอคีย์นั้นนะ หมดอายุแล้วหรือเปล่า?

source: All right, we have changed your password and you should now be able to login! Have fun!
th: โอเค! เราเปลี่ยนรหัสผ่านให้คุณแล้วนะ สามารถเข้าสู่ระบบได้เลย! ขอให้สนุกนะ!

source: Register
th: สมัครสมาชิก

source: Sorry, it's not possible to register at the moment. Please try again later.
th: โทษทีนะ เรายังไม่เปิดให้คุณได้สมัครตอนนี้ ค่อยมาดูใหม่ทีหลังนะ

source: Remember: this seems like it's your second account! Do not multiaccount, or you're likely to get restricted!
th: จำเอาไว้นะ ว่าคุณกำลังสร้างบัญชีอันที่ 2! และการสร้างหลายบัญชีนั้นมันจะทำให้คุณถูกแบนได้เลยนะ

source: Username (2 to 15 characters, alphanumeric, spaces, <code>_[]-</code>)
th: ชื่อผู้ใช้ (2-15 ตัว สามารถใช้ตัวอักษรภาษาอังกฤษ, ตัวเลข, เว้นวรรค หรือสัญลักษณ์ต่อไปนี้ <code>_[]-</code>)

source: Password (at least 8 characters)
th: รหัสผ่าน (อย่างน้อยต้องมี 8 ตัวขึ้นไป)

source: Email
th: อีเมลล์

source: You have been successfully registered on Ainu! You now need to verify your account.
th: คุณได้สมัครบัญชีแล้ว! ตอนนี้ก็เหลือแค่ยืนยันเท่านั้นแหละ

source: Your password is too short! It must be at least 8 characters long.
th: รหัสผ่านของคุณมันสั้นเกินไปนะ อย่างน้อยต้องมี 8 ตัวสิ

source: Your password is one of the most common passwords on the entire internet. No way we're letting you use that!
th: รู้อะไรไหม? รหัสผ่านพวกนี้มันง่ายมากๆ เราจะไม่ให้คุณใช้รหัสผ่านโง่ๆแบบนั้นไม่ได้หรอกนะ!

source: Your username must contain alphanumerical characters, spaces, or any of <code>_[]-</code>
th: ชื่อผู้ใช้จะต้องมี 2-15 ตัว สามารถใช้ตัวอักษรภาษาอังกฤษ, ตัวเลข, เว้นวรรค หรือสัญลักษณ์ต่อไปนี้ <code>_[]-</code> นะ

source: You're not allowed to register with that username.
th: คุณไม่ได้อนุญาตให้ใช้ชื่อนั้นนะ

source: Please pass a valid email address.
th: กรุณาใส่อีเมลที่ถูกต้อง

source: An username can't contain both underscores and spaces.
th: ชื่อผู้ใช้ไม่สามารถใช้ ขีดเส้นใต้ หรือ เว้นวรรค 2 ตัวได้นะ

source: An user with that username already exists!
th: โทษทีนะ แต่ชื่อผู้ใช้นั้นโดยใช้งานไปแล้ว

source: An user with that email address already exists!
th: โทษทีนะ แต่มีใช้อีเมลนั้นไปแล้วนะ

source: Captcha is invalid.
th: ยืนยัน Captcha ไม่ผ่านอะ

source: Whoops, an error slipped in. You might have been registered, though. I don't know.
th: อุย พอดีอยู่ดีๆระบบก็เจ๊ง อาจจะสมัครไปแล้วมั้ง...? ไม่รู้อะ

source: Verify account
th: ยืนยันบัญชี

source: Your account has been created, however it still <b>needs to be verified!</b> Please log in into <b><u>osu! (the game)</u></b> using your account. <b>There is <u>no email confirmation</u> at the moment. All you need to do is connect to Ripple from the osu! client!</b> If you're having trouble, <a href='/doc/1'>follow this guide</a>.
th: บัญชีของคุณได้ถูกสร้างแล้ว แต่! <b>ต้องยืนยันก่อน!</b> กรุณาเข้าสู่ระบบใน <b><u>osu! (ตัวเกม)</u></b> โดยใช้บัญชีของคุณ <b>ตอนนี้ <u>ยังไม่มีระบบยืนยันอีเมล</u> สิ่งที่คุณต้องทำก็คือเชื่อมต่อเซิร์ฟเวอร์ Ripple ผ่านตัวเกม osu! นั้นเอง!</b> หากคุณกำลังมีปัญหาอยู่, <a href='/doc/1'>ลองทำตามนี้ดู!</a>.

source: <b class='big text'>Do not let anyone except yourself log into your Ripple account!</b><br> Get on our <a href='%s'>Discord server's</a> #help channel instead (after following the steps on this page) so that we can help you out if you have trouble connecting.
th: <b class='big text'>อย่าให้ใครยกเว้นตัวเองเข้าบัญชี Ripple ของคุณ!</b><br> ไปที่ <a href='%s'>เซิร์ฟเวอร์ Discord</a> ห้อง #help แทน (ถ้าคุณลองทำตามเว๊ปที่เว๊ปนี้บอกแล้วอะนะ) เพื่อที่จะให้เราช่วยเหลือคุณในการเชื่อมต่อ

source: The Guide (<a href='/doc/connection_guide' target='_blank'>Windows</a>, <a href='/doc/linux' target='_blank'>Linux</a>). TL;DR version below.
th: วิธีเข้า (<a href='/doc/connection_guide' target='_blank'>Windows</a>, <a href='/doc/linux' target='_blank'>Linux</a>) ฉบับย่อๆ

source: Download the server switcher
th: ดาวน์โหลดตัวสลับเซิร์ฟเวอร์

source: Extract it, disable your antivirus, execute <i>RippleServerSwitcher.exe</i> <b>as administrator</b>
th: แตกไฟล์, ปิดแอนตี้ไวรัส (ถ้ามันเตือน), แล้วเปิดโปรแกรม <i>RippleServerSwitcher.exe</i> ในฐานะ <b>แอดมิน</b>

source: Click on <b>Connect to Ripple</b>, then <b>Ok/Yes</b>
th: กดไปที่ปุ่ม <b>Connect to Ripple</b>, จากนั้นกดปุ่ม <b>OK/Yes<b>

source: Make sure the switcher says you're connected to <b>Ripple</b>
th: และตรวจสอบให้แน่ใจว่ามันขึ้น You are connected to <b>Ripple</b>

source: If it says something about read-only mode, go to <code>C:\Windows\System32\Drivers\etc</code>, open the hosts' file Properties and make sure it's not set to "Read only".
th: ถ้ามันขึ้นประมาณว่า read-only อะไรซักอย่างก็ไปที่ <code>C:\Windows\System32\Drivers\etc</code> คลิกขวาที่ไฟล์ '<b>hosts</b>' จากนั้นกดไปที่ คุณสมบัติ (Properties) และเช็คตรงช่อง "Read only" ออก

source: If you're still having trouble, then again, get on our <a href='%s'>Discord server's</a> #help channel. To have a better chance to be answered, say "strawberry" anywhere in your messages so that we know you have actually read this.
th: ถ้ามันยังมีปัญหาอยู่ ก็ไป <a href='%s'>เซิร์ฟเวอร์ดิสคอร์ดของพวกเรา</a> ที่ห้อง #help เพราะเราจะมาช่วยตอบให้เลย พอเข้าไปแล้วให้พิมพ์ว่า "strawberry" ตรงไหนก็ได้ในข้อความเดี๋ยวเราจะมาตอบเองแหละ

source: Waiting for verification
th: กำลังรอการยืนยัน

source: Welcome!
th: ยินดีต้อนรับ!

source: Welcome back!
th: ยินดีต้อนรับกลับมา!

source: Congratulations for not reading things!
th: ขอแสดงความดีด้วยที่คุณนั้นไม่ได้อ่านอะไรเลย

source: Multiaccounts are not allowed on Ripple
th: การปั้มบัญชีไม่อนุญาตในเซิร์ฟเวอร์ Ripple นะ

source: Your new account has been <b>banned</b> and your main account has been <b>restricted</b>. You can appeal in a month by sending an email to <b><a href='https://support.ripple.moe'>support.ripple.moe</a></b>. You better read the rules next time.
th: บัญชีของตุณนั้นได้ถูก<b>แบนเรียบร้อยแล้ว</b> และ บัญชีหลักของคุณนั้นโดน<b>ระงับการใช้งานแล้ว</b> คุณสามารถขอปลดแบนโดยคุณส่งอีเมลมาที่ <b><a href='https://support.ripple.moe'>support.ripple.moe<a></b> อย่าลืมอ่านกฎด้วยละครั้งต่อไป ฮ่า

source: Welcome to Ripple
th: ยินดีต้อนรับเข้าสู่ Ripple

source: We're glad to have you here. <b>Your account is now active.</b> You can now play on Ripple and <a href='/login'>log in</a> on the website!
th: รู้สึกดีจังที่คุณมาอยู่ที่นี้ <b>ตอนนี้บัญชีของคุณได้เปิดใช้งานแล้ว</b> คุณสามารถมาเล่นเซิร์ฟเวอร์ Ripple ได้เลยนะ และก็อย่าลืม <a href='/login'>เข้าสู่ระบบ</a>ในเว๊ปด้วยละ!

source: Here's a few things you might want to check out:
th: อันนี้ถ้าอยากทำก็ทำเลยนะ ถ้าไม่ทำก็ไม่เป็นไร:

source: Login
th: เข้าสู่ระบบ

source: Rules
th: กฏต่างๆ

source: Documentation
th: วิธีการใช้งานต่างๆ

source: Server switcher
th: ตัวสลับเซิร์ฟเวอร์

source: Status
th: สถานะตอนนี้

source: Discord
th: ดิสคอร์ด

source: Subreddit
th: ซับเรดดิท

source: - in case you don't know where to start
th: - ถ้าคุณยังไม่รู้ว่าจะทำอะไรตอนนี้

source: - in case you haven't already read them
th: - ถ้าคุณยังไม่ได้อ่านมัน

source: - in case, well, you need help doing stuff
th: - ถ้า... เอิ่ม... ต้องการความช่วยเหลืออะนะ

source: - in case you believe Ripple is down
th: - ถ้าคุณคิดว่าเซิร์ฟกำลังดับอยู่

source: - in case you want to talk with people about Ripple
th: - ถ้าคุณอยากคุยกับคนอื่นๆที่เล่นเซิร์ฟ Ripple อยู่

source: - just in case
th: - เอาไว้เฉยๆอะแหละ แฮะๆ

source: Recover account
th: กู้คืนบัญชี

source: Can't find a way to get back access to your Ripple account? Fear not! If you have your recovery codes which we recommended you to print you can type one in here and we'll magically log you in this time. After you've managed to get in, please disable and then re-enable 2FA, so you won't risk losing your account again.
th: ไม่รู้ว่าจะทำยังไงถึงจะได้บัญชีคืนหรอ? ไม่ต้องกลัว! ถ้าคุณมีโค้ตกู้คืนซึ่งเราแนะนำคุณให้ปริ้นต์ไว้ คุณสามารถพิมพ์ไว้ที่นี้และเราจะท่องคาถาให้บัญชีคุณออกจากระบบ หลังจากนั้นถ้าคุณเข้ามาแล้ว กรุณาปิดและเปิด 2FA ใหม่ เพื่อที่จะให้บัญชีของคุณไม่เสี่ยงในการหายอีก

source: Oh no you don't.
th: โอ้ ไม่ อย่าบอกนะว่า... ไม่

source: Get out.
th: ออกไป๊

source: Recovery code is invalid.
th: โค้ตกู้คืนไม่ถูกต้อง

source: Elmo! Stop!
th: เอลโม่! หยุดเลยนะ!

source: Stop!
th: หยุดทันที!!!

source: We see that you're trying to sign up while having already signed up as %s! Please note that multiaccounting is punishable, and can lead to a one month restriction!
th: เรารู้นะว่านายจะทำอะไรน่ะ %s! ขอบอกไว้เลยว่าถ้าสร้างบัญชีหลายๆบัญชีอะ ถูกทำโทษได้เลยนะ!! ยังไม่พอแค่นั้นมันจะทำให้โดนแบน 1 เดือนด้วยละ!!!

source: If you're %s, keep in mind that multiaccounting = ban.
th: ถ้าคุณคือ %s บอกเลยว่าสร้างหลายบัญชีนั้น แบนสถานเดียว

source: If you're not %s, but you're using %s's computer, please sign up on Ripple from your own computer.
th: ถ้าคุณไม่ใช่ %s ละก็ แต่คุณกำลังใช้คอม %s อยู่ ไปสมัครที่คอมคุณเถอะนะ

source: If you live with %s and you don't have your own computer from which to sign up on Ripple, then please contact support@ripple.moe, and we'll deal with your specific case.
th: ถ้าคุณอยู่กับ %s แต่คุณไม่มีคอมเล่นแต่อยากจะเล่นกับเซิร์ฟเวอร์เรา กรุณาติดต่อเราที่อีเมล support@ripple.moe เดี๋ยวเราไปคุยเอง

source: This warning may pop up also if you're using another computer on the same network of %s. As long as you're not using the same computer, you should be all good.
th: บางทีคำเตือนนี้อาจจะเด้งมาที่คอมเครื่องอื่นๆแต่ใช้เน็ตเร้าเตอร์เดียวกันกับ %s แต่ถ้าไม่ได้ใช้คอมเครื่องเดียวกัน นั้นก็ไม่มีปัญหาหรอกนะ

source: Don't stop me now!
th: อย่าหยุดช้านนน

source: Bring me back to safety!
th: กลับไปเดี๋ยวนี้แหละ!

source: Log in
th: เข้าสู่ระบบ

source: Username (or email)
th: ชื่อผู้ใช้ (หรืออีเมลล์ก็ได้อะนะ)

source: (forgot?)
th: (หรือลืมรหัสผ่าน?)

source: Username or password not set.
th: ชื่อผู้ใช้หรือรหัสผ่านยังไม่ได้ใส่เลย

source: No user with such %s!
th: ไม่เห็นเจอคนที่ชื่อ %s เลย!

source: Your password is sooooooo old, that we don't even know how to deal with it anymore. Could you please change it?
th: รหัสผ่านแม่มโคตรจะเก่าาาาาาาาาาาาาาาาาาาาาาาาา เลย เราแทบจะทนไม่ไหวกับรหัสผ่านเน่าๆแบบนี้แล้วนะ ช่วยเปลี่ยนใหม่หน่อยได้มั้ย!?

source: Wrong password.
th: รหัสผ่านผิด

source: You will need to verify your account first.
th: คุณจะต้องไปยืนยันบัญชีก่อนเข้านะ

source: You are not allowed to login. This means your account is either banned or locked.
th: เราไม่ให้เข้าหรอกนะ นั้นหมายความว่าคุณอาจจะโดนแบนหรือโดนล็อคบัญชีอยู่ก็เป็นได้

source: Hey %s! You are now logged in.
th: เฮ้ %s! ว่าไง กลับมาแล้วสินะ!

source: You're already logged out!
th: คุณออกจากระบบไปนานแล้วนิหน่า!

source: Successfully logged out.
th: ออกจากระบบแล้ว

source: Forgot your password? Worry not! Here you can reset it. Just tell us your username or email address, and we'll take care of it. You will receive an email at the email address you used to sign up on Ripple. To continue the password reset procedure, click the link on that email.
th: ลืมพาสเวิร์ดหรอ? ไม่ต้องเครียด! มาที่นี่แล้วคุณสามารถรีเซ็ตได้ แค่บอกชื่อผู้ใช้หรืออีเมลของคุณ และเราจะจัดการให้คุณเอง คุณจะได้รับอีเมลจากเราที่อีเมลล์ที่คุณสามารถในเซิร์ฟเวอร์ Ripple เพื่อทำรายการขั้นต่อไป กรุณากดไปที่ลิ้งค์อีเมลที่เราส่งไปนะ

source: You look pretty banned/locked here.
th: อืม... เหมือนคุณน่าจะโดนแบนหรือโดนล็อกนะ

source: Done! You should shortly receive an email from us at the email you used to sign up on Ripple.
th: เสร็จแล้ว! อีกหน่อยคุณจะได้รับอีเมลจากเราในเมลที่คุณสมัครใน Ripple นะ

source: Ripple password recovery instructions
th: วิธีรีเซ็ตรหัสผ่านในเซิร์ฟเวอร์ Ripple

source: Hey %s! Someone, which we really hope was you, requested a password reset for your account. In case it was you, please <a href='%s'>click here</a> to reset your password on Ripple. Otherwise, silently ignore this email.
th: เฮ้ ว่าไง %s พอดี... มีคน (หวังว่านะจะเป็นคุณนะ...) ขอรีเซ็ตรหัสผ่านสำหรับบัญชีของคุณ ถ้านี่คือคุณละก็ กรุณา <a href='%s'>คลิกที่นี่</a> เพื่อรีเซ็ตรหัสผ่านของคุณในเซิร์ฟเวอร์ Ripple แต่ถ้าไม่ใช่คุณละก็ไม่ต้องสนใจอีเมลฉบับนี้หรอกนะ

source: Not Found
th: ไม่เจอ

source: We're sorry, but we were unable to find the content you were looking for!
th: ขอโทษจริงๆที่เราหาไม่เจอ เราหาทั่วทุกมุมแล้วเร็วไม่เจออะไรเลย!

source: Home page
th: หน้าหลัก

source: Leaderboard
th: กระดานคะแนน

source: Help
th: ช่วยเหลือ

source: About
th: เกี่ยวกับเรา

source: Chat (Discord)
th: แชท (Discord)

source: Contact support
th: ติดต่อฝ่ายช่วยเหลือ

source: Beatmaps
th: บีทแมพ

source: Donate
th: โดเนท

source: Profile
th: โปรไฟล์

source: Friends
th: เพื่อน

source: Settings
th: การตั้งค่า

source: Log out
th: ออกจากระบบ

source: Looking for someone?
th: หาใครอยู่หรือเปล่า?

source: Home Page
th: หน้าหลัก

source: Welcome to Ripple.
th: ยินดีต้อนรับเข้าสู่ Ripple

source: Ripple is a private osu! server, featuring multiplayer, PP, a very active community and a development team going strong implementing new features and squashing bugs. <a href='/about'>You can check out even more features here.</a> It has also a very friendly community, and it's <a href='https://zxq.co/ripple/ripple'>open source!</a> Just so you know, <b>we currently have %s users online and %s registered users!</b>
th: Ripple คือเซิร์ฟเวอร์ osu! ส่วนตัว ซึ่งมีระบบเล่นหลายคน, PP, ชุมชนที่มีคนเยอะมาก และทีมงานสรรหาระบบใหม่ๆเข้าเซิร์ฟเวอร์! <a href='/about'>ลองไปดูว่าอะไรคือเซิร์ฟนี้ที่นี่</a> และคนในเซิร์ฟเวอร์ใจดีด้วยนะ! เรายังเปิด <a href='https://zxq.co/ripple/ripple'>ซอร์ซโค้ด</a> ให้ได้ใช้ด้วย! จะได้รู้ว่าเราไม่ได้ทำอะไรแย่ๆ <b>ซึ่งตอนนี้เรามี คนทั้งหมด %s คนที่กำลังออนไลน์อยู่ และ คนที่สมัครเข้าเซิร์ฟแล้ว %s คน!</b>

source: What are you waiting for? Join Ripple! It's risk-free: you won't get your account banned on the official server if you play on Ripple.<br>You can also switch anytime between the official osu! server and Ripple!
th: แล้วจะรออะไรอยู่ล่ะ? มาเล่นเซิร์ฟ Ripple สิ! ไม่ต้องกลัวเรื่องการโดนแบน: เพราะคุณจะไม่โดนแบนในเซิร์ฟหลักหรอกถ้าคุณเล่นเซิร์ฟเวอร์ Ripple!<br>คุณยังสามารถสลับเซิร์ฟเวอร์ระหว่างเซิร์ฟเวอร์แท้และเซิร์ฟเวอร์ Ripple ได้ด้วยหละ!

source: Howdy, %s!
th: ว่าไง %s!

source: Welcome back to Ripple. We currently have <b>%s online users and %s total registered users.</b> Nice day to farm a few maps, isn't it?
th: ยินดีต้อนรับกลับสู่เซิร์ฟเวอร์ Ripple ตอนนี้เรามี <b>คนทั้งหมด %s คนที่กำลังออนไลน์อยู่ และ คนที่สมัครเข้าเซิร์ฟแล้ว %s คน</b> เป็นวันที่ดีสำหรับการฟาร์มแมพเลยว่ามั้ย?

source: Latest news from our blog
th: ข่าวสารล่าสุดจากพวกเรา

source: Ripple's score submission is currently in maintenance mode. You will not be allowed to submit scores for the time being.
th: ระบบคะแนนในเซิร์ฟเวอร์ Ripple กำลังปิดปรับปรุงตอนนี้ คุณจะไม่สามารถลงคะแนนอะไรใดๆไม่ได้เลย! ขออภัยในความไม่สะดวก!

source: The Ripple website is currently in maintenance mode. Only certain users are allowed to access the full website.
th: เว๊ปไซต์ Ripple อยู่ในช่วงปิดปรับปรุง เฉพาะผู้ใช้ที่อนุญาตเท่านั้นที่สามารถใช้เว๊ปไซต์อย่างเต็มรูปแบบได้!

source: Your account is currently in restricted mode. You will not be able to do certain actions, and your profile can only be seen by you and by Ripple's staff. If you believe we have mistaken putting you in restricted mode, or a month has passed since you first saw this, then you can send an appeal at <a href='https://support.ripple.moe'>support.ripple.moe</a>.
th: บัญชีคุณตอนนี้กำลังถูกระงับ! คุณจะไม่สามารถทำอะไรได้และคุณจะถูกเห็นโดยคุณเองและทีมงาน Ripple เท่านั้น! ถ้าคุณรู้สึกว่าเราทำอะไรผิดพลาดไป หรือ หลังจากผ่านไปเดือนนึง คุณสามารถลองขอปลดได้ที่ <a href='https://support.ripple.moe'>support.ripple.moe</a>

source: &copy; 2015-%d Ripple, using Hanayo %s.
th: &copy; 2015-%d Ripple ใช้ Hanayo เวอร์ชั่น %s

source: Team
th: ทีมงาน

source: Who is working on this thing?
th: ใครเป็นคนทำส่วนนี้เนี่ย?

source: Developer docs
th: เอกสารสำหรับผู้พัฒนา

source: See what changed!
th: ดูซิ ว่ามีอะไรเปลี่ยนไปบ้าง!

source: Changelog
th: ประวัติการเปลี่ยนแปลง

source: Blog
th: บล็อก

source: What's going on under the hood?
th: เกิดอะไรที่นี่กันนะ?

source: Follow us on Twitter!
th: ติดตามพวกเราในทวิตเตอร์!

source: Share irrelevant opinions on reddit!
th: แชร์อะไรที่ไร้สาระในเรดดิท

source: Language
th: ภาษา

source: Artist
th: เจ้าของเพลง

source: Title
th: ชื่อเพลง

source: Creator
th: ผู้สร้าง

source: Source
th: ที่มา

source: Circle Size
th: ขนาดวงกลม

source: HP Drain
th: ความเร็วการลด HP

source: Overall Difficulty
th: ระดับความยากรวมๆ

source: Passes/Plays
th: ผ่าน/เล่นไปกี่ครั้งแล้ว

source: Approach Rate
th: ความไวของ Approach Rate

source: Star Difficulty
th: ระดับดาว

source: Length
th: ความยาว

source: download
th: ดาวน์โหลด

source: download (no video)
th: ดาวน์โหลด (แบบไม่เอาวีดีโอ)

source: Rank in RAP
th: แรงค์แมพใน RAP

source: Two Factor Authentication
th: การยืนยันแบบ 2 ขั้นตอน

source: Before proceding further on Ripple, we require you to use your Google Authenticator App to use the code for Ripple, so that we can log you in.
th: ก่อนที่จะดำเนินการเพิ่มเติมเกี่ยวกับ Ripple เราต้องการให้คุณใช้แอป Google Authenticator เพื่อใช้โค้ตสำหรับ Ripple เพื่อที่ให้เราสามารถให้คุณเข้าสู่ระบบได้

source: Before proceding any further on Ripple, we require you to use the message you just received on telegram to log in to your account.
th: ก่อนที่จะดำเนินการเพิ่มเติมเกี่ยวกับ Ripple เราต้องการให้คุณใช้ข้อความที่คุณเพิ่งได้รับใน Telegram เพื่อเข้าสู่ระบบ

source: Lost your phone, or can't access Google Authenticator?
th: ทำโทรศัพท์หายหรือเข้า Google Authenticator ไม่ได้งั้นหรอ?

source: Click here to use a recovery code.
th: กดที่นี่เพื่อใช้โค้ตกู้คืน

source: Telegram code
th: โค้ต Telegram

source: (send again?)
th: (ส่งอีกรอบมั้ย?)

source: Google Authenticator passcode
th: โค้ต Google Authenticator

source: Hey, %s.
th: ว่าไง %s

source: You need to complete the 2fa challenge first.
th: คุณจะต้องผ่านการยืนยันตัว 2FA ก่อนนะ

source: A new code has been generated and sent to you through Telegram.
th: ได้ทำการสร้างโค้ตใหม่แล้วกรุณาตรวจสอบโค้ตใหม่ที่ Telegram

source: You've been successfully logged in.
th: คุณได้ทำการเข้าสู่ระบบแล้ว

source: Ooops! Looks like something went really wrong while trying to process your request. Perhaps report this to a Ripple developer? Retrying doing what you were trying to do might work, too.
th: อุย... เหมือนว่ามีอะไรผิดปกติขณะทำรายการของคุณน่ะ ลองติดต่อทีมงาน Ripple ดูนะ...? หรือลองใหม่อีกรอบก็อาจจะติด... เหมือนกัน

source: Ripple is a private osu! server.
th: Ripple คือเซิร์ฟเวอร์ osu! ส่วนตัว

source: There are many like it, but this one is ours.
th: มีหลายเซิร์ฟที่คล้ายๆกัน แต่เซิร์ฟนี้เซิฟเรา

source: Don't you like %s?
th: คุณไม่ชอบ %s หรือ?

source: We have leaderboards.
th: เรามีกระดานคะแนน

source: Online user listing.
th: รายชื่อคนที่ออนไลน์

source: Free osu!direct.
th: osu!direct ให้ใช้แบบฟรีๆ

source: Global leaderboards.
th: กระดานคะแนนในเกมส์

source: and PP for all game modes, including Relax and Autopilot!
th: และ PP สำหรับทุกเกมส์โหมด ทั้งโหมด Relax และ Autopilot!

source: Ranking queue for unranked beatmaps.
th: ระบบขอบีทแมพให้อยู่ในโหมดแรงค์

source: Spectator.
th: โหมดคนดู

source: Multiplayer.
th: เล่นแบบหลายคน

source: FokaBot, our chat bot
th: FokaBot, บอทแชทของพวกเรา

source: with plenty of functions for just about anything, <a href="/doc/4">check it out!</a>
th: พร้อมกับระบบสุดเจ๋งหลายอย่างที่มี <a href="/doc/4">ลองดูสิ!</a>

source: And a lot more to come!
th: และอื่นๆอีกมากมายที่จะมาเร็วๆนี้

source: Ripple is the result of the hard work of two Italian developers, who got tired about the whole osu! ecosystem, and also because they wanted to play with a few banned friends.
th: Ripple คือเซิร์ฟเวอร์ที่ทำมาจากทีมงานอิตาลีสองคน ที่เบื่อระบบ osu! เดิมๆ และอยากเล่นกับเพื่อนๆที่โดนแบนในเซิรฺ์ฟเวอร์หลัก

source: It has now evolved into the largest available osu! private server, with more than 70,000 registered users. <a href="/register">Signing up</a> on Ripple won't result in getting your account on osu! restricted, so what are you waiting for?! Come join us! %s
th: ตอนนี้เซิร์ฟเวอร์ของพวกเรานั้น เป็นเซิร์ฟเวอร์ที่ใหญ่ที่สุดของเซิร์ฟเวอร์ทั้งหมด โดยมีคนสมัครเข้าเซิร์ฟทั้งหมด 70,000 คนแล้ว! <a href="/register">สมัครตอนนี้</a>เลย! และไม่ต้องกลัวว่าบัญชีคุณนั้นจะถูกแบน แล้วจะรออะไรอยู่ละ!? มาเล่นกันเถอะ %s!

source: In case you want to make sure we're not doing shady stuff with your data, you can also check the <a href="https://zxq.co/ripple/ripple">source code</a> Ripple is running on.
th: ถ้ารู้สึกว่ากลัวว่าเราจะทำอะไรแปลกๆ เราสามารถให้คุณดู <a href="https://zxq.co/ripple/ripple">src</a> ของพวกเราเพื่อให้รู้ว่าเราไม่ได้ทำอะไรแย่ๆได้เลย!

source: This is the changelog. Changes are published here as soon as they hit the production status (as in, live on the website).
th: นี่คือประวัติการเปลี่ยนแปลง การเปลี่ยนแปลงจะถูกเผยแพร่ที่นี่ทันทีที่เมื่ออยู่ในโหมดสถานะสาธารณะ (เช่นอยู่บนเว็บไซต์นี้ไงละ)

source: For various reasons, some software of Ripple does not contribute to the changelog, to which this website is a part of. In case you want to see the changelog of Hanayo, you can do so by <a href="https://zxq.co/ripple/hanayo/commits/master">clicking here</a>.
th: ด้วยเหตุผลหลายประการซอฟต์แวร์บางส่วนของ Ripple ไม่ได้มีส่วนร่วมในประวัติการการเปลี่ยนแปลงซึ่งเว็บไซต์นี้เป็นส่วนหนึ่ง ในกรณีที่คุณต้องการเห็นการเปลี่ยนแปลงของ Hanayo คุณสามารถทำได้โดย <a href="https://zxq.co/ripple/hanayo/commits/master">คลิกที่นี่</a>

source: Author
th: ผู้จัดทำ

source: Subject
th: หัวข้อ

source: Time
th: เวลา

source: View document
th: ดูเอกสาร

source: Documentation file not found!
th: ไม่พบไฟล์เอกสาร!

source: View all docs
th: ดูเอกสารทั้งหมด

source: Need some help getting around? Look no further! From here you will be able to view our documentation, which is basically a very simplistic wiki.
th: ต้องการความช่วยเหลืองั้นหรอ? ไม่ต้องไปหาที่ไหนเลย! ถ้าคุณมาที่นี่แล้ว คุณจะสามารถดูเอกสารของเราซึ่งเป็นวิกิที่เรียบง่ายมากสุดๆ

source: Looks like there is no documentation on this ripple instance!
th: ดูเหมือนว่าไม่มีเอกสารในอินสแตนซ์ของเซิร์ฟโคลน Ripple นี้เลยนะ!

source: On this page you can see all of your friends, and unfriend them as you see fit.
th: ในหน้านี้ คุณจะเจอเพื่อนทั้งหมดของคุณ และคุณสามารถเลิกเป็นเพื่อนได้แล้วแต่คุณเลย

source: Mutual
th: เป็นเพื่อกันทั้งสองฝ่าย

source: Remove
th: เอาออก
