Repository: th4nhtung/hanayo
Catalog: data/locales/templates-*.po
Languages: th

source: <b>Sunpy</b>, for <a href='https://github.com/osufx/catch-the-pp'>catch-the-pp</a>, used as catch the beat pp calculator.
th: <b>Sunpy</b> สำหรับ <a href='https://github.com/osufx/catch-the-pp'>catch-the-pp</a> ใช้เป็นระบบ PP ในโหมด Catch The Beat

source: <b>Avail</b>, for having hosted Ripple on his server.
th: <b>Avail</b> สำหรับเซิร์ฟเวอร์ของเขาที่ใช้เปิด Ripple

source: <b>Angela Guerra</b>, for designing the Ripple logo.
th: <b>Angela Guerra</b> สำหรับการออกแบบโลโก้ Ripple

source: <b><a id='everyone' class='clickable'>Everyone</a></b> who has supported the Ripple project by donating or inviting other people.
th: <b><a id='everyone' class='clickable'>และทุกๆคน</a></b> ที่สนับสนุนโปรเจค Ripple โดยการโดเนทและเชิญคนมาเล่น

source: They told me these are very cool people.
th: เขาว่ากันว่าคนพวกนี้เทพชิบหาย

source: Looking for how you should contact our team? Check out <a href='https://support.ripple.moe/'>this page</a>.
th: กำลังหาวิธีติดต่อทีมงานเรางั้นหรอ? ลองดู <a href='https://support.ripple.moe/'>หน้านี้</a> สิ

source: And more...
th: และอื่นๆ

source: Do you want to be in this list?
th: อยากอยู่ในรายชื่อนี้หรอ?

source: Support us with a donation!
th: สนับสนุนเราโดยการบริจาคสิ!

source: (You get other cool perks too)
th: (คุณจะได้รับสิทธิ์เจ๋งๆด้วยล่ะ)

source: The Ripple API is the system through which developers can create applications to interact with Ripple. <b>If you're asked to fill out an API token from this page, be wary and only actually create the token if you really trust the owner of the application.</b>
th: Ripple API เป็นระบบที่ผู้พัฒนาสามารถสร้างแอปพลิเคชันเพื่อโต้ตอบกับ Ripple <b>หากคุณถูกขอให้กรอกโทเค็น API จากหน้านี้ให้ระวังและสร้างโทเค็นจริงๆ เท่านั้นหากคุณเชื่อถือเจ้าของแอปพลิเคชันจริงๆ</b>

source: The 'Ranking Criteria' are as follows:
th: 'เกณฑ์การแรงค์' มีดังนี้:

source: Follow the <a href='https://osu.ppy.sh/help/wiki/Ranking_Criteria/'>Bancho Ranking Criteria</a> to some extend
th: ทำตาม <a href='https://osu.ppy.sh/help/wiki/Ranking_Criteria/'>เกณฑ์การแรงค์ของ Bancho</a>

source: No clear abuse of any systems (pp/stars)
th: ห้ามมีการละเมิดระบบที่ชัดเจน (PP/ดาว)

source: No speedup or re-upload of existing maps
th: ห้ามมีใช้แมพ Speed Up หรืออัปโหลดแผนที่ที่มีอยู่อีกครั้ง

source: No Jump/Stream Training Compilations
th: ห้ามเป็นแมพผึก Jump/Stream

source: At least 66% Completion for 7+ Minute songs, anything else completely mapped
th: คนที่ผ่านแมพจะต้องมีอย่างน้อย 66% สำหรับเพลง 7 นาทีขึ้นไป ที่เหลือจะเป็นแมพสมบูรณ์

source: Popularity does not mean rankable
th: ความดังของแมพไม่ได้หมายความว่าจะสามารถแรงค์ได้

source: Community
th: ชุมชน

source: Multiplayer listing
th: รายชื่อห้องเล่นหลายคน

source: Discord Server
th: เซิร์ฟเวอร์ Discord

source: Read more
th: อ่านเพิ่มเติม

source: Connection guide
th: วิธีการเชื่อมต่อ

source: Classic
th: คลาสสิก

source: New!
th: ใหม่!

source: Total Play Time
th: เวลาเล่นทั้งหมด
