Repository: th4nhtung/hanayo
Catalog: data/locales/templates-*.po
Languages: th

source: Here you can generate a new IRC token. You can use it to connect to Ripple's chat using IRC. Remember that your IRC token is like a password, anyone who knows it, has access to your account. If you're interested knowing how to connect to Ripple's chat via IRC, you may want to check out <a href="/doc/11">this</a>.
th: คุณสามารถสร้างโทเค็น IRC ใหม่ได้ที่นี่ และคุณสามารถใช้มันเพื่อเชื่อมต่อกับการแชทของ Ripple โดยใช้ IRC อย่าลืมว่าโทเค็น IRC ของคุณเป็นเหมือนรหัสผ่าน ใครก็ตามที่รู้จักสามารถเข้าถึงบัญชีของคุณได้ หากคุณสนใจที่จะรู้วิธีเชื่อมต่อการแชทของ Ripple ผ่านทาง IRC คุณอาจต้องการดู <a href="/doc/11">สิ่งนี้</a>

source: Generate a new token!
th: สร้างโทเค็นใหม่

source: Rank
th: ที่

source: Player
th: ผู้เล่น

source: PP/Score
th: PP/คะแนน

source: Accuracy
th: ความแม่นยำ

source: Playcount
th: เล่นไปทั้งหมด

source: %s's profile
th: โปรไฟล์ของ %s

source: User is <b>silenced</b> for %s, expires %s.
th: ผู้ใช้คนนี้ <b>โดนใบ้</b> มาได้ %s แล้ว หมดเวลาตอน %s

source: User is <b>%s</b>
th: ผู้ใช้คนนี้กำลัง <b>%s</b>

source: pending verification
th: รอการยืนยัน

source: banned
th: ถูกแบน

source: restricted
th: ถูกระงับ

source: locked
th: โดนล็อก

source: User not found
th: เราไม่เห็นเจอคนนั้นเลยนะ

source: (aka <b>%s</b>)
th: (รู้จักกันในนามว่า <b>%s</b>)

source: Online
th: กำลังออนไลน์

source: Offline
th: ออฟไลน์

source: Unknown
th: ไม่รู้

source: <b>%s</b> is a Ripple player from <b>%s</b>.
th: <b>%s</b> คือผู้เล่น Ripple จากประเทศ <b>%s</b>

source: Last seen: %s.
th: เห็นล่าสุดเมื่อ: %s

source: They signed up on Ripple %s.
th: สมัครใน Ripple ตั้งแต่ %s

source: They play with %s.
th: เขาเล่นด้วย %s

source: Mouse
th: เม้าส์

source: Tablet
th: เม้าส์ปากกา

source: Keyboard
th: คีย์บอร์ด

source: Touchscreen
th: หน้าจอสัมผัส

source: Spoon
th: ช้อน

source: Leap motion
th: ปากกาเลเซอร์

source: Oculus rift
th: แว่น VR

source: Dick
th: หำ

source: Eggplant
th: มะเขือม่วง

source: This user hasn't got any badges!
th: คนนี้ไม่ได้มีโล่อะไรเลย

source: Global rank
th: ลำดับทั่วโลก

source: Country rank
th: ลำดับประเทศ

source: Ranked score
th: คะแนนแบบแรงค์

source: Total score
th: คะแนนทั้งหมด

source: Replays watched
th: มีคนดู Replays ทั้งหมด

source: Total hits
th: กดไปทั้งหมด

source: Level %s
th: เลเวล %s

source: Achievements
th: ความสำเร็จ

source: Support Ripple
th: สนับสนุนเซิร์ฟ Ripple

source: You are a donor!
th: คุณคือผู้บริจาค!

source: Your donor expires <b>%s</b>. No need to feel guilty for not having donated!
th: การบริจาคของคุณจะหมดตอน <b>%s</b> ไม่ต้องรู้สึกผิดหรอกนะถ้าคุณไม่ได้โดเนท

source: Did you know?
th: รู้หมือไร่

source: (Probably.)
th: (น่าจะรู้อยู่นะ)

source: (Probably not.)
th: (คงไม่น่าจะรู้)

source: Ripple is not cheap to run.
th: Ripple นั้นไม่ใช่ถูกๆที่จะเปิด

source: While we provide this service for free, we still have to pay for it, and if we always took the money out of our own pockets, 1. we would be broke, 2. we wouldn't be able to upgrade our hardware to accomodate our users. While we do have loads of software optimisations that allow us to have Ripple run crazy fast while still being on not so high-end hardware, the more users we have, the higher-end our hardware needs to be. So we are asking you for help on this :).
th: ในขณะที่เราให้บริการฟรีเรายังคงต้องจ่ายเงินและถ้าเรานำเงินออกจากกระเป๋าของเราเสมอ ซึ่งนั้นก็แปลว่า 1.เราจะจนแบบกินแกลบ 2.เราจะอับจนเกินเหตุและไม่มีตังอัพเกรดฮาร์ดแวร์ของเราให้รองรับผู้ใช้ของเราได้ ซึ่งพวกเรานั้นมีการเพิ่มประสิทธิภาพของซอฟต์แวร์จำนวนมาก ที่ทำให้ Ripple นั้นทำงานแบบแรงทะลุนรกในขณะที่ยังไม่ได้ใช้ฮาร์ดแวร์ระดับสูง ผู้ใช้ยิ่งเยอะ เราก็ต้องมีฮาร์ดแวร์ที่สูงขึ้น ดังนั้นเราจึงขอความช่วยเหลือจากคุณในเรื่องนี้ยังไงละ :D

source: We are still students.
th: พวกเรายังเป็นนักเรียนอยู่

source: Ripple developers, and most of the Ripple staff, do not have a day job. This means that we get most of our income as students from doing small jobs as "freelancers" every so often, or, you know, allowance.
th: ทีมงานและพนักงาน Ripple ส่วนใหญ่ไม่มีงานประจำวัน ซึ่งหมายความว่าเราจะได้รับรายได้ส่วนใหญ่จากการที่นักเรียนทำงานเล็ก ๆ เช่น เป็น "ฟรีแลนซ์" ทุกครั้ง หรือคุณก็รู้ๆอยู่นะ แบบว่า... เบี้ยเลี้ยงอ่ะ

source: We do not have ads. And never will.
th: พวกเราไม่มีโฆษณา และ ไม่มีวันมีแน่ๆ

source: We love picking random icons from our icon library.
th: เราชอบเอาอะไรไม่รู้มาเป็นไอคอน

source: You may have adblock enabled and have not noticed, but we don't have ads anywhere on our website. We believe ads are bad, as they can be very annoying to you and that you would rather spend a few bucks to help us rather than watch annoying ads all the time.
th: คุณอาจจะมี Adblock และไม่ได้สังเกตว่าเรานั้นไม่มีโฆษณาในเว็บไซต์ของเรา เราเชื่อว่าโฆษณาไม่ดีเนื่องจากโฆษณาเหล่านี้อาจสร้างความรำคาญให้คุณและคุณควรใช้เงินสองสามเหรียญเพื่อช่วยเราแทนที่จะดูโฆษณาที่น่ารำคาญตลอดเวลา

source: So what can you do?
th: แล้วคุณสามารถทำอะไรได้บ้างล่ะ?

source: Well, you can give us money.
th: งั้น คุณก็ให้เงินเราก็ได้สิ

source: Well, you can give us even more money.
th: งั้น คุณก็ให้เงินเราเพิ่มก็ได้สิ

source: Here's what you get:
th: และนี่คือสิ่งที่คุณได้:

source: Yellow username
th: ชื่อเหลือง

source: Donor badge
th: โล่คนบริจาค

source: Custom badge editor
th: ตัวทำโล่พิเศษ

source: Friends ranking
th: กระดานคะแนนแบบเพื่อน

source: Discord privileges
th: สิทธิพิเศษใน Discord

source: Profile background
th: ภาพพื้นหลังในโปร์ไฟล์

source: Account wipe
th: ล้างบัญชี

source: More to come!
th: และอื่นๆอีกมากมาย

source: Just like in osu!, you get a <b>shiny yellow username</b> in the in-game chat to show everyone you're a really cool dude who has helped us pay the server bills.
th: เช่นเดียวกับใน osu! คุณจะได้รับ <b>ชื่อสีเหลืองแสนมันวาว</b> ในการแชทในเกมเพื่อแสดงให้ทุกคนเห็นว่าคุณมันเก๋ามากที่ช่วยโดเนทค่าเซิร์ฟเวอร์

source: Again, just like in osu!, you will get a <b>donor badge</b> on your profile, to show everyone you're supporting us.
th: ก็เหมือน osu! อีกแหละ คุณจะได้รับ <b>โล่บริจาค</b> ในโปรไฟล์ของคุณ เพื่อให้ชาวโลกรู้ว่าคุณนั้นโดเนทช่วยพวกเรา

source: You get to be able to create your <b>own personal badge</b>, with custom text and icon, to show off on your profile! Let the world know you're an anchor. Or prank people showing a spinnin' wheel with "Loading..."! Up to you.
th: คุณจะสามารถสร้าง <b>โล่ส่วนตัวของคุณเอง</b> พร้อมข้อความและไอคอนที่กำหนดเองเพื่อแสดงในโปรไฟล์ของคุณ! ให้ชาวโลกรู้ว่าคุณเป็นเทพทรูหรือคนที่เล่นพิเรนแบบทำโล่รูปโหลด "กำลังโหลด ..."! แล้วแต่คุณเลย

source: <b>Competing with friends</b> is really cool, you can play on the leaderboard with someone more or less on your level, without getting crippling depression and RSI for not beating that pro!
th: <b>การแข่งขันกับเพื่อน</b> มันเจ๋งสุดๆไปเลยละ คุณนั้นสามารถแข่งกับคนที่มีเลเวลสูงกว่าหรือน้อยกว่าโดยที่คุณไม่ได้เป็นโรคซึมเศร้าหรือเป็น RSI ที่ไปท้าตีไอ้จอมโหดนั้นด้วยละ ฮ่า!

source: You'll get exclusive access to the <b>"#donators"</b> text and voice channels, you'll be able to change your discord nickname and you'll get a custom role with custom username colour!
th: คุณจะมีสิทธิพิเศษใช้ห้อง <b>"#donators"</b> ทั้งห้องข้อความและห้องเสียง คุณสามารถเปลี่ยนชื่อเล่นในเซิร์ฟ Discord และคุณยังสามารถได้ยศแบบตั้งเองทั้งสีและชื่อได้

source: Think about <b>spicing your profile up with some eggplants</b>? Got you covered! Having donor privileges, you get to be able to change your profile background.
th: คิดเกี่ยวกับ<b>การเปลี่ยนพื้นหลังโปรไฟล์เป็นมะเขือม่วงงั้นหรอ</b>? ไม่ต้องห่วงเราเตรียมไว้แล้ว โดยที่คุณนั้นมีสิทธิพิเศษสำหรับคนบริจาค คุณสามารถเปลี่ยนพื้นหลังของโปรไฟล์คุณได้เลย

source: Want to start over one more time? With donor you can! Normally you can only <a href='https://support.ripple.moe' target='_blank'>request an account wipe</a> once, but having donated you'll be able to do it once again.
th: อยากเริ่มใหม่จากศูนย์งั้นหรอ? ถ้าคุณมีสิทธิพิเศษของคนบริจาคละก็คุณทำได้! โดยปกติคุณสามารถ <a href='https://support.ripple.moe' target='_blank'>ขอล้างบัญชี</a>ได้หนึ่งครั้ง แต่การบริจาคคุณจะสามารถทำได้อีกครั้ง

source: <b>Who knows</b> what we could implement next? You could be able to do even <i>more</i> stuff for donors once we implement it.
th: <b>ใครจะไปรู้ล่ะ</b> เราจะสามารถจะพัฒนาอะไรครั้งต่อไป คุณสามารถทำได้<i>มากกว่า</i>แม้กระทั่งสิ่งที่สำหรับผู้บริจาคมีแล้ว

source: And this is how you pay
th: และนี้คือวิธีบริจาค

source: You may donate through either <b>PayPal</b> (or credit/debit card linked to PayPal) or <b>Bitcoin</b>. Use the slider below to choose the amount of months you'd like to have the donor benefits, and the cost will be instantly calculated. Remember that if, for instance, you choose to donate € 4 instead of € 3.51, you will only be given one donor month.
th: คุณสามารถบริจาคผ่าน <b>PayPal</b> (หรือบัตรเครดิต/เดบิตที่เชื่อมโยงกับ PayPal) หรือ <b>Bitcoin</b> ใช้แถบเลื่อนด้านล่างเพื่อเลือกจำนวนเดือนที่คุณต้องการรับผลประโยชน์จากผู้บริจาคและค่าใช้จ่ายจะถูกคำนวณทันที โปรดจำไว้ว่าหากคุณเลือกบริจาค €4 แทนที่จะเป็น €3.51 คุณจะได้รับเงินบริจาคหนึ่งเดือนเท่านั้น

source: Loading...
th: กำลังโหลด...

source: User:
th: ผู้ใช้:

source: Send %s BTC to this Bitcoin address:
th: ส่ง %s BTC ไปที่บัญชี Bitcoin นี้:

source: Afterwards, <b>please send an email to <a href="mailto:howl@ripple.moe">howl@ripple.moe</a></b> containing the transaction hash!
th: หลังจากนั้น <b>โปรดส่งอีเมลไปที่ <a href="mailto:howl@ripple.moe">howl@ripple.moe</a> </b>ที่มีแฮชการทำธุรกรรม!

source: I've donated, now what?
th: โอเค โดเนทเรียบร้อยแล้ว แล้วไงต่อ

source: You'll have to wait until we verify and process your payment. It can take up to <b>12 hours</b>. If 12 hours have passed and you still haven't received your Donor tag, contact a <b>Dev/Community Manager</b> in our Discord server or send an email to <b><a href="mailto:support@ripple.moe">support@ripple.moe</a></b>. Once we have processed your payment, you'll receive an <b>email</b> to the address you've used to sign up and you'll get <b>all the donor privileges, except the Discord ones</b>. To get the Discord donor privileges, go <a href="/settings/discord">here</a>.
th: คุณจะต้องรอจนกว่าเราจะตรวจสอบและประมวลผลการชำระเงินของคุณ อาจใช้เวลานานถึง <b>12 ชั่วโมง</b> หากเวลาผ่านไป 12 ชั่วโมงและคุณยังไม่ได้รับแท็กผู้บริจาคโปรดติดต่อ <b>ทีมงานผู้พัฒนา/ผู้จัดการความสงบของชุมชน</b> ในเซิร์ฟเวอร์ Discord ของเราหรือส่งอีเมลไปที่ <b><a href="mailto:support@ripple.moe">support@ripple.moe</a></b> เมื่อเราประมวลผลการชำระเงินของคุณแล้วคุณจะได้รับ <b>อีเมล</b> ไปยังที่อยู่ที่คุณเคยสมัครใช้งานและคุณจะได้รับ <b>สิทธิ์ผู้บริจาคทั้งหมดยกเว้นรายการ Discord</b> หากต้องการรับสิทธิ์ผู้บริจาค Discord ให้ไป<a href="/settings/discord">ที่นี่</a>

source: Please log in to get supporter
th: กรุณาเข้าสู่ระบบเพื่อรับซัพพอร์ตเตอร์

source: Userpage
th: คำคมประจำตัว

source: Avatar
th: รูปโปรไฟล์

source: Discord donor
th: ผู้บริจาค Discord

source: Two factor authentication is enabled on your account.
th: การยืนยันแบบ 2 ขั้นตอนได้เปิดสำหรับบัญชีคุณแล้ว

source: Two factor authentication is not enabled on your account.
th: การยืนยันแบบ 2 ขั้นตอนไม่ได้เปิดในบัญชีของคุณ

source: Google Authenticator (TOTP) based 2FA
th: ระบบการยืนยันแบบ 2 ขั้นตอนแบบ Google Authenticator (TOTP)

source: At the moment you currently have set up Telegram Two Factor Authentication. Should you wish to disable it, please fill out the following form:
th: ในขณะนี้คุณกำลังใช้การยืนยันแบบ 2 ขั้นตอนแบบ Telegram หากคุณต้องการปิดการใช้งานโปรดกรอกแบบฟอร์มต่อไปนี้:

source: At the moment you currently have set up TOTP-based (Google Authenticator) Two Factor Authentication. Should you wish to disable it, please fill out the following form:
th: ในขณะนี้คุณกำลังใช้การยืนยันแบบ 2 ขั้นตอนแบบ TOTP (Google Authenticator) หากคุณต้องการปิดการใช้งานโปรดกรอกแบบฟอร์มต่อไปนี้:

source: Disable Telegram 2FA
th: เลิกใช้ 2FA ของ Telegram

source: Disable TOTP-based 2FA
th: เลิกใช้ TOTP 2FA

source: Google Authenticator recovery keys
th: คีย์กู้คืนของ Google Authenticator

source: These are the only thing that will let you get back into your Ripple account if you lose your device. Our suggestion is to paste them inside a document in your word processor (Microsoft Word, LibreOffice Writer), print them and store them in a safe place.
th: สิ่งเหล่านี้เป็นสิ่งเดียวที่จะช่วยให้คุณกลับเข้าสู่บัญชี Ripple ของคุณได้หากคุณทำอุปกรณ์หาย เราแนะนำให้เซิฟเป็นไฟล์เอกสาร (อาทิเช่น Microsoft Word, LibreOffice Writer) ปริ้นต์มันออกมาและเก็บไว้ในที่ปลอดภัย

source: Open File
th: เปิดไฟล์

source: Save
th: บันทึก

source: Thank you for supporting us and have fun on Ripple!
th: ขอขอบคุณคุณที่สนับสนุนเราและขอให้สนุกในเซิร์ฟ Ripple!

source: Donors get special privileges on our Discord server too!
th: ผู้บริจาคได้รับสิทธิพิเศษบนเซิร์ฟเวอร์ Discord ของเราด้วย!

source: Discord is a chatroom with text and voice channels, bots and lots of other cool features. You can <b>download Discord for free <a href="http://discord.gg/" target="_blank">here</a></b> and you can <b>join our official Discord server <a href="%s" target="_blank">here</a></b>.
th: Discord เป็นแชทที่มีแชทข้อความและห้องเสียง, บอทและคุณสมบัติเจ๋งๆ อีกมากมาย คุณสามารถ <b>ดาวน์โหลด Discord ได้ฟรี<a href="http://discord.gg/" target="_blank">ที่นี่</a></b> และคุณสามารถ <b>เข้าเซิร์ฟเวอร์ Discord อย่างเป็นทางการของเรา<a href="%s" target="_blank">ได้ที่นี่</a></b>

source: Here's what you get if you link your Discord account:
th: นี่คือสิ่งที่คุณจะได้รับหากคุณเชื่อมโยงบัญชี Discord ของคุณ:

source: Access to /nick command, to change your Discord nickname
th: ใช้คำสั่ง /nick เพื่อเปลี่ยนชื่อเล่น Discord ของคุณ

source: Access to #donators text and voice channels
th: เข้าห้อง #donators ทั้งห้องแชทและห้องเสียง

source: Username on donors list
th: ชื่ออยู่ในผู้บริจาค

source: Custom role with custom username
th: ยศพิเศษแบบตั้งเองพร้อมชื่อเล่นที่สามารถตั้งได้

source: To get these perks, first of all <a href="%s" target="_blank">join our Discord server</a>, then click this fancy button:
th: หากต้องการรับสิทธิพิเศษเหล่านี้ก่อนอื่น <a href="%s" target="_blank">เข้าร่วมเซิร์ฟเวอร์ Discord ของเราก่อน</a> จากนั้นคลิกปุ่มแฟนซีนี้:

source: Get Discord donor privileges
th: รับสิทธิพิเศษ Discord

source: New password (leave blank if you don't want to change it)
th: รหัสผ่านใหม่ (ไม่ต้องใส่ถ้าไม่อยากเปลี่ยน)

source: Current password
th: รหัสผ่านปัจจุบัน

source: BBCode syntax reference
th: วิธีใช้ BBCode

source: General
th: ข้อมูลเบื้องต้น

source: Email address
th: อีเมลล์

source: Alternative username (cannot be used for login)
th: ชื่อที่รู้ในนามต่างๆ (ไม่สามารถเอาอันนี้ไปล็อกอินได้นะ!)

source: Also known as...
th: รู้จักกันในนามว่า...

source: Custom badge
th: โล่พิเศษ

source: Enable
th: เปิด

source: <b>Do not use offensive badges and do not pretend to be someone else with your badge.</b> If you abuse the badges system, you'll be silenced and you won't be able to edit your custom badge anymore.
th: <b>คำเตือน!</b> โปรดอย่าตั้งชื่อโล่ให้ดูแบบหยาบคายมากนัก หรือตั้งโล่ตัวเองเหมือนใหญ่เช่น Owner เป็นต้น เราจะนำคุณออกไม่ให้ใช้ระบบโล่พิเศษ เราถือว่าเตือนแล้วนะ

source: Icon reference
th: ดูคลังรูปไอคอน

source: Dinosaur, oompa-loompa, cool guy...
th: ฉายาของตัวเอง

source: Playstyle
th: เล่นด้วยอะไรเอ่ย?

source: Authorized applications
th: แอพพลิเคชั่นที่ได้รับอนุญาต

source: From here you can check all the applications you granted authorization to your account, and revoke their permissions if necessary.
th: จากที่นี่คุณสามารถตรวจสอบแอปพลิเคชันทั้งหมดที่คุณให้การอนุญาตกับบัญชีของคุณและยกเลิกการอนุญาตหากจำเป็น

source: ... but it looks like you have none!
th: ... แต่เหมือนว่าคุณจะไม่มีนะ!

source: That authorization has been successfully revoked.
th: เอาการให้สิทธิ์ดังกล่าวออกสำเร็จแล้ว

source: Authorization created %s
th: อนุญาตเมื่อ %s

source: Owner
th: เจ้าของแอพ

source: Revoke
th: เอาออก

source: Dark site
th: เว๊ปธีมสีดำ

source: Preferences
th: โหมดเพิ่มเติมอื่นๆ

source: TOTP-based 2FA has been enabled on your account.
th: การยืนยันแบบ 2 ขั้นตอนแบบ TOTP ได้เปิดใช้งานในบัญชีของคุณแล้ว

source: Passcode is invalid. Perhaps it expired?
th: รหัสผ่านไม่ถูกต้อง หรือมันหมดอายุก่อนนะ?

source: No passcode/secret was given. Please try again
th: ไม่ได้รับรหัสผ่าน/รหัสลับ กรุณาลองอีกครั้ง

source: TOTP-based 2FA is already enabled!
th: การยืนยันแบบ 2 ขั้นตอนแบบ TOTP ได้เปิดใช้งานอยู่แล้ว

source: You currently have Telegram 2FA enabled. You first need to disable that if you want to use TOTP-based 2FA.
th: ขณะนี้คุณเปิดใช้งาน Telegram 2FA คุณต้องปิดการใช้งานก่อนหากคุณต้องการใช้ 2FA ที่ใช้ TOTP

source: 2FA disabled successfully.
th: ได้ปิดใช้งานการยืนยันแบบ 2 ขั้นตอนแล้ว

source: Changing avatar is currently not possible.
th: ตอนนี้เรายังไม่ให้เปลี่ยนรูปโปรไฟล์นะ

source: An error occurred.
th: อยู่ดีๆก็เกิดปัญหาขึ้นมา

source: We were not able to save your avatar.
th: เราไม่สามารถบันทึกโปรไฟล์ของคุณได้

source: Your avatar was successfully changed. It may take some time to properly update. To force a cache refresh, you can use CTRL+F5.
th: เปลี่ยนรูปให้แล้วจ้า อาจจะใช้เวลานิดนึง แต่ถ้ารีบก็กด CTRL + F5 เลยเดี๋ยวมันก็เปลี่ยนให้เอง

source: Internal Server Error
th: เซิร์ฟเวอร์มีปัญหา

source: You're not a donor!
th: คุณไม่ได้เป็นผู้บริจาค

source: You've not joined the discord server! Links to it are below on the page. Please join the server before attempting to connect your account to Discord.
th: คุณไม่ได้เข้าร่วมเซิร์ฟเวอร์ Discord! ลิงค์อยู่ที่ข้างล่างของหน้า โปรดเข้าร่วมเซิร์ฟเวอร์ก่อนที่จะพยายามเชื่อมต่อบัญชีของคุณกับ Discord

source: Your account has been linked successfully!
th: บัญชีได้ถูกเชื่อมแล้ว

source: Your new IRC token is <code>%s</code>. The old IRC token is not valid anymore.<br>Keep it safe, don't show it around, and store it now! We won't show it to you again.
th: โทเค็น IRC ใหม่ของคุณคือ <code>%s</code> โทเค็น IRC เก่าจะไม่ถูกต้องอีกต่อไป<br>เก็บไว้ให้ปลอดภัยเพราะเราจะไม่แสดงให้เห็นอีก เร็วเข้าเก็บไว้เลย! เราจะไม่แสดงให้คุณเห็นอีกครั้ง

source: Your profile background has been saved.
th: ภาพพื้นหลังในโปรไฟล์ของคุณได้ถูกบันทึกแล้ว!

source: We were not able to save your profile background.
th: เราไม่สามารถบันทึกพื้นหลังโปรไฟล์ของคุณได้

source: Background type
th: รูปแบบพื้นหลัง

source: None
th: ไม่มี

source: Image
th: รูปภาพ

source: Solid colour
th: สี

source: Colour is invalid
th: สีบ้าอะไรเนี่ย!?

source: You have been automatically logged out of your account because your account has either been banned or locked. Should you believe this is a mistake, you can contact our support team at support@ripple.moe.
th: คุณออกจากระบบบัญชีของคุณโดยอัตโนมัติเนื่องจากบัญชีของคุณถูกแบนหรือถูกล็อค หากคุณเชื่อว่าเราทำอะไรผิดพลาดไปคุณสามารถติดต่อทีมสนับสนุนของเราที่ support@ripple.moe

source: You have been automatically logged out for security reasons. Please <a href='/login?redir=%s'>log back in</a>.
th: คุณออกจากระบบโดยอัตโนมัติด้วยเหตุผลด้านความปลอดภัย โปรด <a href='/login?redir=%s'>ลงชื่อเข้าใช้อีกครั้ง</a>

source: You need to login first.
th: คุณต้องเข้าสู่ระบบก่อนนะ

source: Forbidden
th: ไม่ได้รับอนุญาต

source: You should not be 'round here.
th: คุณไม่น่าจะอยู่แถวๆนี้นะ

source: It seems like the original version of this file has been updated, so this file is out of date and may contain inaccurate information. If you want to make sure to be up-to-date, please refer to the <a href="%s%s">English version</a>.
th: ดูเหมือนว่าไฟล์ต้นฉบับเวอร์ชันนี้จะได้รับการอัปเดตดังนั้นไฟล์นี้อาจจะล้าสมัยและอาจมีข้อมูลที่ไม่ถูกต้อง หากคุณต้องการแน่ใจว่าเป็นรุ่นล่าสุดโปรดดู <a href="%s%s">เวอร์ชันภาษาอังกฤษ</a>

source: If you truly have understood what's written above and you have understood that creating a multiaccount will lead to a restriction on your main account, you can click here and you'll be brought to the sign up page.
th: ถ้าคุณเข้าใจว่าเราอธิบายให้คุณฟังแล้ว และคุณเข้าใจว่าการสร้างหลายๆบัญชีทำให้ถูกแบนได้ คุณสามารถกดข้อความนี้เพื่อไปสมัครได้เลย

source: You look new here. Allow us to introduce you to what Ripple is.
th: เหมือนคุณพึ่งมาใหม่นะ เรามาแนะนำกันดีกว่าว่าเซิร์ฟเวอร์ Ripple คืออะไร

source: Log in with Ripple
th: ล็อกอินด้วย Ripple

source: This application will be able to:
th: แอปพลิเคชันนี้จะสามารถ:

source: Identify
th: ยืนยันและตรวจสอบ

source: See your public information (everything somebody can see on your user profile), however with this alone it will not be able to see your private information (for instance your email address).
th: ดูข้อมูลสาธารณะของคุณ (ทุกอย่างที่สามารถดูได้ในโปรไฟล์ผู้ใช้ของคุณ) อย่างไรก็ตามสิ่งนี้จะไม่สามารถดูข้อมูลส่วนตัวของคุณ (เช่นที่อยู่อีเมลของคุณ)

source: Read private information
th: อ่านข้อมูลส่วนตัว

source: This application will be able to see your email address, and any private information we will add in the future.
th: แอปพลิเคชันนี้จะสามารถดูที่อยู่อีเมลของคุณและข้อมูลส่วนตัวใด ๆ ที่เราจะเพิ่มในอนาคต

source: Write
th: เขียน

source: This application will be able to make modifications to your Ripple account. This is potentially really dangerous! Use this only with applications that you trust.
th: แอปพลิเคชันนี้จะสามารถแก้ไขบัญชี Ripple ของคุณได้ นี่อาจเป็นอันตรายจริงๆนะ! ใช้สิ่งนี้กับแอปพลิเคชันที่คุณเชื่อถือเท่านั้น

source: Access to Bancho
th: เข้า Bancho

source: This application will be able to make you appear online ingame and use the chat.
th: แอปพลิเคชันนี้จะทำให้คุณปรากฏตัวในเกมออนไลน์และใช้สามารถใช้การแชทได้

source: Approve
th: ยอมรับ

source: Deny
th: ไม่ยอมรับ

source: This is a list of the wonderful people who keep Ripple up and running and deal with its community.
th: ในหน้านี้จะเป็นรายชื่อคนที่น่ารักมากๆที่ช่วยให้เซิร์ฟเวอร์ Ripple ยังเปิดอยู่และจัดการกับชุมชน

source: Community Managers
th: ผู้จัดการความสงบของชุมชน

source: Community Managers deal with bans, silences, name changes and pretty much everything that has to do with the community.
th: ผู้จัดการความสงบของชุมชนจะจัดการเรื่องแบน การใบ้ การเปลี่ยนชื่อ แบบประมาณว่าทุกอย่างเลยก็ว่าได้ที่เกี่ยวกับชุมชน

source: They take care of our Discord server and reply to emails sent to the support services (email and support.ripple.moe). Community Managers have a red name in the in-game chat.
th: พวกเขาดูแลเซิร์ฟเวอร์ Discord ของเราและตอบกลับอีเมลที่ส่งไปยังบริการสนับสนุน (อีเมลและ support.ripple.moe) ผู้จัดการความสงบของชุมชนจะมีชื่อสีแดงในแชทในเกม

source: Developers
th: ทีมงานผู้พัฒนา

source: Developers add new features to the server, squash bugs, keep the server up and running and take care of its maintenance.
th: ทีมงานผู้พัฒนาเพิ่มระบบใหม่ๆให้กับเซิร์ฟเวอร์, แก้บั๊ก, รักษาเซิร์ฟเวอร์ให้พร้อมใช้งานและดูแลการบำรุงรักษา

source: They don't do anything related to the community. Developers have a blue name in the in-game chat.
th: เขาไม่ทำอะไรมากหรอกเกี่ยวกับพวกชุมชน ทีมงานผู้พัฒนาจะมีชื่อสีฟ้าในแชทในเกม

source: Chat Moderators
th: ผู้จัดการความสงบของแชท

source: Chat moderators manage the chat to make sure The Law&trade; (the rules) is respected.
th: ผู้จัดการความสงบของแชทจัดการเกี่ยวกับแชทเพื่อให้แน่ใจว่า The Law&trade; (หรือกฎนั้นเอง) นั้นได้ถูกทำตามแล้ว

source: BATs play beatmaps in the ranking queue and decide whether they are good enough to be ranked or not.
th: BATs จะเล่นบีทแมพต่างๆในรายชื่อบีทแมพอยู่ในขอให้อยู่ในโหมดแรงค์และจัดการว่ามันควรได้ถูกแรงค์หรือไม่

source: Special thanks
th: ขอขอบคุณเป็นพิเศษ

source: Here's a list of people who helped with Ripple.
th: และนี่คือรายชื่อผู้คนที่ช่วยเกี่ยวกับเซิร์ฟเวอร์ Ripple

source: <b>Franc[e]sco/lolisamurai</b>, for <a href='https://github.com/Francesco149/oppai-ng'>oppai-ng</a>, used as standard pp calculator.
th: <b>Franc[e]sco/lolisamurai</b> สำหรับ <a href='https://github.com/Francesco149/oppai-ng'>oppai-ng</a> ใช้เป็นระบบ PP ในโหมด Standard

source: <b>Tom94</b>, for <a href='https://github.com/ppy/osu-performance'>osu-performance</a>, used as a reference for our mania pp calculator.
th: <b>Tom94</b> สำหรับ <a href='https://github.com/ppy/osu-performance'>osu-performance</a> ใช้เป็นโค้ตอ้างอิงสำหรับระบบ PP ในโหมด Mania
